program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "2.1.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 128, 3000]> logmel_data) {
            tensor<string, []> var_84_pad_type_0 = const()[name = tensor<string, []>("op_84_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_84_pad_0 = const()[name = tensor<string, []>("op_84_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_84_strides_0 = const()[name = tensor<string, []>("op_84_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_84_dilations_0 = const()[name = tensor<string, []>("op_84_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_84_groups_0 = const()[name = tensor<string, []>("op_84_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1280, 128, 3]> weight_3_to_fp16 = const()[name = tensor<string, []>("weight_3_to_fp16"), val = tensor<fp16, [1280, 128, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1280]> bias_3_to_fp16 = const()[name = tensor<string, []>("bias_3_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(983168)))];
            tensor<fp16, [1, 128, 3000]> logmel_data_to_fp16 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data)[name = tensor<string, []>("cast_131")];
            tensor<fp16, [1, 1280, 3000]> var_84_cast_fp16 = conv(bias = bias_3_to_fp16, dilations = var_84_dilations_0, groups = var_84_groups_0, pad = var_84_pad_0, pad_type = var_84_pad_type_0, strides = var_84_strides_0, weight = weight_3_to_fp16, x = logmel_data_to_fp16)[name = tensor<string, []>("op_84_cast_fp16")];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 3000]> input_1_cast_fp16 = gelu(mode = input_1_mode_0, x = var_84_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_102_pad_type_0 = const()[name = tensor<string, []>("op_102_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_102_pad_0 = const()[name = tensor<string, []>("op_102_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_102_strides_0 = const()[name = tensor<string, []>("op_102_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_102_dilations_0 = const()[name = tensor<string, []>("op_102_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_102_groups_0 = const()[name = tensor<string, []>("op_102_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 3]> weight_7_to_fp16 = const()[name = tensor<string, []>("weight_7_to_fp16"), val = tensor<fp16, [1280, 1280, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(985792)))];
            tensor<fp16, [1280]> bias_7_to_fp16 = const()[name = tensor<string, []>("bias_7_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10816256)))];
            tensor<fp16, [1, 1280, 1500]> var_102_cast_fp16 = conv(bias = bias_7_to_fp16, dilations = var_102_dilations_0, groups = var_102_groups_0, pad = var_102_pad_0, pad_type = var_102_pad_type_0, strides = var_102_strides_0, weight = weight_7_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_102_cast_fp16")];
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1500]> x_3_cast_fp16 = gelu(mode = x_3_mode_0, x = var_102_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [1280, 1500]> var_107_to_fp16 = const()[name = tensor<string, []>("op_107_to_fp16"), val = tensor<fp16, [1280, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10818880)))];
            tensor<fp16, [1, 1280, 1500]> var_109_cast_fp16 = add(x = x_3_cast_fp16, y = var_107_to_fp16)[name = tensor<string, []>("op_109_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_109_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_124 = const()[name = tensor<string, []>("op_124"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_3_axes_0 = const()[name = tensor<string, []>("input_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1280]> input_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_3_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14658944)))];
            tensor<fp16, [1280]> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14661568)))];
            tensor<fp16, []> var_140_to_fp16 = const()[name = tensor<string, []>("op_140_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_0, beta = input_3_beta_0_to_fp16, epsilon = var_140_to_fp16, gamma = input_3_gamma_0_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_1_strides_0 = const()[name = tensor<string, []>("q_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_1_dilations_0 = const()[name = tensor<string, []>("q_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_1_groups_0 = const()[name = tensor<string, []>("q_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> var_175_weight_0_to_fp16 = const()[name = tensor<string, []>("op_175_weight_0_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14664192)))];
            tensor<fp16, [1280]> var_175_bias_0_to_fp16 = const()[name = tensor<string, []>("op_175_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17941056)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_175_cast_fp16 = conv(bias = var_175_bias_0_to_fp16, dilations = q_1_dilations_0, groups = q_1_groups_0, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = q_1_strides_0, weight = var_175_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_175_cast_fp16")];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_1_strides_0 = const()[name = tensor<string, []>("k_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_1_dilations_0 = const()[name = tensor<string, []>("k_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_1_groups_0 = const()[name = tensor<string, []>("k_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17943680)))];
            tensor<fp16, [1, 1280, 1, 1500]> k_1_cast_fp16 = conv(dilations = k_1_dilations_0, groups = k_1_groups_0, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = k_1_strides_0, weight = blocks_0_attn_key_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<string, []> var_173_pad_type_0 = const()[name = tensor<string, []>("op_173_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_173_strides_0 = const()[name = tensor<string, []>("op_173_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_173_pad_0 = const()[name = tensor<string, []>("op_173_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_173_dilations_0 = const()[name = tensor<string, []>("op_173_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_173_groups_0 = const()[name = tensor<string, []>("op_173_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21220544)))];
            tensor<fp16, [1280]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24497408)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_173_cast_fp16 = conv(bias = blocks_0_attn_value_bias_to_fp16, dilations = var_173_dilations_0, groups = var_173_groups_0, pad = var_173_pad_0, pad_type = var_173_pad_type_0, strides = var_173_strides_0, weight = blocks_0_attn_value_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_173_cast_fp16")];
            tensor<int32, [20]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [20]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_176_axis_0 = const()[name = tensor<string, []>("op_176_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_15, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_16, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_17, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_18, tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16_19 = split(axis = var_176_axis_0, split_sizes = tile_0, x = var_175_cast_fp16)[name = tensor<string, []>("op_176_cast_fp16")];
            tensor<int32, [4]> var_197_perm_0 = const()[name = tensor<string, []>("op_197_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [20]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [20]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_198_axis_0 = const()[name = tensor<string, []>("op_198_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 1280]> var_197_cast_fp16 = transpose(perm = var_197_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_32")];
            tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_7, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_8, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_9, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_10, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_11, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_12, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_13, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_14, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_15, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_16, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_17, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_18, tensor<fp16, [1, 1500, 1, 64]> var_198_cast_fp16_19 = split(axis = var_198_axis_0, split_sizes = tile_1, x = var_197_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<int32, [20]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [20]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_219_axis_0 = const()[name = tensor<string, []>("op_219_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_15, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_16, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_17, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_18, tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16_19 = split(axis = var_219_axis_0, split_sizes = tile_2, x = var_173_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<string, []> aw_1_equation_0 = const()[name = tensor<string, []>("aw_1_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_1_cast_fp16 = einsum(equation = aw_1_equation_0, values = (var_198_cast_fp16_0, var_176_cast_fp16_0))[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<string, []> aw_3_equation_0 = const()[name = tensor<string, []>("aw_3_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_3_cast_fp16 = einsum(equation = aw_3_equation_0, values = (var_198_cast_fp16_1, var_176_cast_fp16_1))[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<string, []> aw_5_equation_0 = const()[name = tensor<string, []>("aw_5_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_5_cast_fp16 = einsum(equation = aw_5_equation_0, values = (var_198_cast_fp16_2, var_176_cast_fp16_2))[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<string, []> aw_7_equation_0 = const()[name = tensor<string, []>("aw_7_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_7_cast_fp16 = einsum(equation = aw_7_equation_0, values = (var_198_cast_fp16_3, var_176_cast_fp16_3))[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<string, []> aw_9_equation_0 = const()[name = tensor<string, []>("aw_9_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_9_cast_fp16 = einsum(equation = aw_9_equation_0, values = (var_198_cast_fp16_4, var_176_cast_fp16_4))[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<string, []> aw_11_equation_0 = const()[name = tensor<string, []>("aw_11_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_11_cast_fp16 = einsum(equation = aw_11_equation_0, values = (var_198_cast_fp16_5, var_176_cast_fp16_5))[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<string, []> aw_13_equation_0 = const()[name = tensor<string, []>("aw_13_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_13_cast_fp16 = einsum(equation = aw_13_equation_0, values = (var_198_cast_fp16_6, var_176_cast_fp16_6))[name = tensor<string, []>("aw_13_cast_fp16")];
            tensor<string, []> aw_15_equation_0 = const()[name = tensor<string, []>("aw_15_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_15_cast_fp16 = einsum(equation = aw_15_equation_0, values = (var_198_cast_fp16_7, var_176_cast_fp16_7))[name = tensor<string, []>("aw_15_cast_fp16")];
            tensor<string, []> aw_17_equation_0 = const()[name = tensor<string, []>("aw_17_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_17_cast_fp16 = einsum(equation = aw_17_equation_0, values = (var_198_cast_fp16_8, var_176_cast_fp16_8))[name = tensor<string, []>("aw_17_cast_fp16")];
            tensor<string, []> aw_19_equation_0 = const()[name = tensor<string, []>("aw_19_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_19_cast_fp16 = einsum(equation = aw_19_equation_0, values = (var_198_cast_fp16_9, var_176_cast_fp16_9))[name = tensor<string, []>("aw_19_cast_fp16")];
            tensor<string, []> aw_21_equation_0 = const()[name = tensor<string, []>("aw_21_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_21_cast_fp16 = einsum(equation = aw_21_equation_0, values = (var_198_cast_fp16_10, var_176_cast_fp16_10))[name = tensor<string, []>("aw_21_cast_fp16")];
            tensor<string, []> aw_23_equation_0 = const()[name = tensor<string, []>("aw_23_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_23_cast_fp16 = einsum(equation = aw_23_equation_0, values = (var_198_cast_fp16_11, var_176_cast_fp16_11))[name = tensor<string, []>("aw_23_cast_fp16")];
            tensor<string, []> aw_25_equation_0 = const()[name = tensor<string, []>("aw_25_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_25_cast_fp16 = einsum(equation = aw_25_equation_0, values = (var_198_cast_fp16_12, var_176_cast_fp16_12))[name = tensor<string, []>("aw_25_cast_fp16")];
            tensor<string, []> aw_27_equation_0 = const()[name = tensor<string, []>("aw_27_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_27_cast_fp16 = einsum(equation = aw_27_equation_0, values = (var_198_cast_fp16_13, var_176_cast_fp16_13))[name = tensor<string, []>("aw_27_cast_fp16")];
            tensor<string, []> aw_29_equation_0 = const()[name = tensor<string, []>("aw_29_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_29_cast_fp16 = einsum(equation = aw_29_equation_0, values = (var_198_cast_fp16_14, var_176_cast_fp16_14))[name = tensor<string, []>("aw_29_cast_fp16")];
            tensor<string, []> aw_31_equation_0 = const()[name = tensor<string, []>("aw_31_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_31_cast_fp16 = einsum(equation = aw_31_equation_0, values = (var_198_cast_fp16_15, var_176_cast_fp16_15))[name = tensor<string, []>("aw_31_cast_fp16")];
            tensor<string, []> aw_33_equation_0 = const()[name = tensor<string, []>("aw_33_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_33_cast_fp16 = einsum(equation = aw_33_equation_0, values = (var_198_cast_fp16_16, var_176_cast_fp16_16))[name = tensor<string, []>("aw_33_cast_fp16")];
            tensor<string, []> aw_35_equation_0 = const()[name = tensor<string, []>("aw_35_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_35_cast_fp16 = einsum(equation = aw_35_equation_0, values = (var_198_cast_fp16_17, var_176_cast_fp16_17))[name = tensor<string, []>("aw_35_cast_fp16")];
            tensor<string, []> aw_37_equation_0 = const()[name = tensor<string, []>("aw_37_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_37_cast_fp16 = einsum(equation = aw_37_equation_0, values = (var_198_cast_fp16_18, var_176_cast_fp16_18))[name = tensor<string, []>("aw_37_cast_fp16")];
            tensor<string, []> aw_39_equation_0 = const()[name = tensor<string, []>("aw_39_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_39_cast_fp16 = einsum(equation = aw_39_equation_0, values = (var_198_cast_fp16_19, var_176_cast_fp16_19))[name = tensor<string, []>("aw_39_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_280_cast_fp16 = softmax(axis = var_124, x = aw_1_cast_fp16)[name = tensor<string, []>("op_280_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_281_cast_fp16 = softmax(axis = var_124, x = aw_3_cast_fp16)[name = tensor<string, []>("op_281_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_282_cast_fp16 = softmax(axis = var_124, x = aw_5_cast_fp16)[name = tensor<string, []>("op_282_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_283_cast_fp16 = softmax(axis = var_124, x = aw_7_cast_fp16)[name = tensor<string, []>("op_283_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_284_cast_fp16 = softmax(axis = var_124, x = aw_9_cast_fp16)[name = tensor<string, []>("op_284_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_285_cast_fp16 = softmax(axis = var_124, x = aw_11_cast_fp16)[name = tensor<string, []>("op_285_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_286_cast_fp16 = softmax(axis = var_124, x = aw_13_cast_fp16)[name = tensor<string, []>("op_286_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_287_cast_fp16 = softmax(axis = var_124, x = aw_15_cast_fp16)[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_288_cast_fp16 = softmax(axis = var_124, x = aw_17_cast_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_289_cast_fp16 = softmax(axis = var_124, x = aw_19_cast_fp16)[name = tensor<string, []>("op_289_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_290_cast_fp16 = softmax(axis = var_124, x = aw_21_cast_fp16)[name = tensor<string, []>("op_290_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_291_cast_fp16 = softmax(axis = var_124, x = aw_23_cast_fp16)[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_292_cast_fp16 = softmax(axis = var_124, x = aw_25_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_293_cast_fp16 = softmax(axis = var_124, x = aw_27_cast_fp16)[name = tensor<string, []>("op_293_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_294_cast_fp16 = softmax(axis = var_124, x = aw_29_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_295_cast_fp16 = softmax(axis = var_124, x = aw_31_cast_fp16)[name = tensor<string, []>("op_295_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_296_cast_fp16 = softmax(axis = var_124, x = aw_33_cast_fp16)[name = tensor<string, []>("op_296_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_297_cast_fp16 = softmax(axis = var_124, x = aw_35_cast_fp16)[name = tensor<string, []>("op_297_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_298_cast_fp16 = softmax(axis = var_124, x = aw_37_cast_fp16)[name = tensor<string, []>("op_298_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_299_cast_fp16 = softmax(axis = var_124, x = aw_39_cast_fp16)[name = tensor<string, []>("op_299_cast_fp16")];
            tensor<string, []> var_301_equation_0 = const()[name = tensor<string, []>("op_301_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_301_cast_fp16 = einsum(equation = var_301_equation_0, values = (var_219_cast_fp16_0, var_280_cast_fp16))[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<string, []> var_303_equation_0 = const()[name = tensor<string, []>("op_303_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_303_cast_fp16 = einsum(equation = var_303_equation_0, values = (var_219_cast_fp16_1, var_281_cast_fp16))[name = tensor<string, []>("op_303_cast_fp16")];
            tensor<string, []> var_305_equation_0 = const()[name = tensor<string, []>("op_305_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_305_cast_fp16 = einsum(equation = var_305_equation_0, values = (var_219_cast_fp16_2, var_282_cast_fp16))[name = tensor<string, []>("op_305_cast_fp16")];
            tensor<string, []> var_307_equation_0 = const()[name = tensor<string, []>("op_307_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_307_cast_fp16 = einsum(equation = var_307_equation_0, values = (var_219_cast_fp16_3, var_283_cast_fp16))[name = tensor<string, []>("op_307_cast_fp16")];
            tensor<string, []> var_309_equation_0 = const()[name = tensor<string, []>("op_309_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_309_cast_fp16 = einsum(equation = var_309_equation_0, values = (var_219_cast_fp16_4, var_284_cast_fp16))[name = tensor<string, []>("op_309_cast_fp16")];
            tensor<string, []> var_311_equation_0 = const()[name = tensor<string, []>("op_311_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_311_cast_fp16 = einsum(equation = var_311_equation_0, values = (var_219_cast_fp16_5, var_285_cast_fp16))[name = tensor<string, []>("op_311_cast_fp16")];
            tensor<string, []> var_313_equation_0 = const()[name = tensor<string, []>("op_313_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_313_cast_fp16 = einsum(equation = var_313_equation_0, values = (var_219_cast_fp16_6, var_286_cast_fp16))[name = tensor<string, []>("op_313_cast_fp16")];
            tensor<string, []> var_315_equation_0 = const()[name = tensor<string, []>("op_315_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_315_cast_fp16 = einsum(equation = var_315_equation_0, values = (var_219_cast_fp16_7, var_287_cast_fp16))[name = tensor<string, []>("op_315_cast_fp16")];
            tensor<string, []> var_317_equation_0 = const()[name = tensor<string, []>("op_317_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_317_cast_fp16 = einsum(equation = var_317_equation_0, values = (var_219_cast_fp16_8, var_288_cast_fp16))[name = tensor<string, []>("op_317_cast_fp16")];
            tensor<string, []> var_319_equation_0 = const()[name = tensor<string, []>("op_319_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_319_cast_fp16 = einsum(equation = var_319_equation_0, values = (var_219_cast_fp16_9, var_289_cast_fp16))[name = tensor<string, []>("op_319_cast_fp16")];
            tensor<string, []> var_321_equation_0 = const()[name = tensor<string, []>("op_321_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_321_cast_fp16 = einsum(equation = var_321_equation_0, values = (var_219_cast_fp16_10, var_290_cast_fp16))[name = tensor<string, []>("op_321_cast_fp16")];
            tensor<string, []> var_323_equation_0 = const()[name = tensor<string, []>("op_323_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_323_cast_fp16 = einsum(equation = var_323_equation_0, values = (var_219_cast_fp16_11, var_291_cast_fp16))[name = tensor<string, []>("op_323_cast_fp16")];
            tensor<string, []> var_325_equation_0 = const()[name = tensor<string, []>("op_325_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_325_cast_fp16 = einsum(equation = var_325_equation_0, values = (var_219_cast_fp16_12, var_292_cast_fp16))[name = tensor<string, []>("op_325_cast_fp16")];
            tensor<string, []> var_327_equation_0 = const()[name = tensor<string, []>("op_327_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_327_cast_fp16 = einsum(equation = var_327_equation_0, values = (var_219_cast_fp16_13, var_293_cast_fp16))[name = tensor<string, []>("op_327_cast_fp16")];
            tensor<string, []> var_329_equation_0 = const()[name = tensor<string, []>("op_329_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_329_cast_fp16 = einsum(equation = var_329_equation_0, values = (var_219_cast_fp16_14, var_294_cast_fp16))[name = tensor<string, []>("op_329_cast_fp16")];
            tensor<string, []> var_331_equation_0 = const()[name = tensor<string, []>("op_331_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_331_cast_fp16 = einsum(equation = var_331_equation_0, values = (var_219_cast_fp16_15, var_295_cast_fp16))[name = tensor<string, []>("op_331_cast_fp16")];
            tensor<string, []> var_333_equation_0 = const()[name = tensor<string, []>("op_333_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_333_cast_fp16 = einsum(equation = var_333_equation_0, values = (var_219_cast_fp16_16, var_296_cast_fp16))[name = tensor<string, []>("op_333_cast_fp16")];
            tensor<string, []> var_335_equation_0 = const()[name = tensor<string, []>("op_335_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_335_cast_fp16 = einsum(equation = var_335_equation_0, values = (var_219_cast_fp16_17, var_297_cast_fp16))[name = tensor<string, []>("op_335_cast_fp16")];
            tensor<string, []> var_337_equation_0 = const()[name = tensor<string, []>("op_337_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_337_cast_fp16 = einsum(equation = var_337_equation_0, values = (var_219_cast_fp16_18, var_298_cast_fp16))[name = tensor<string, []>("op_337_cast_fp16")];
            tensor<string, []> var_339_equation_0 = const()[name = tensor<string, []>("op_339_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_339_cast_fp16 = einsum(equation = var_339_equation_0, values = (var_219_cast_fp16_19, var_299_cast_fp16))[name = tensor<string, []>("op_339_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1280, 1, 1500]> input_5_cast_fp16 = concat(axis = var_124, interleave = input_5_interleave_0, values = (var_301_cast_fp16, var_303_cast_fp16, var_305_cast_fp16, var_307_cast_fp16, var_309_cast_fp16, var_311_cast_fp16, var_313_cast_fp16, var_315_cast_fp16, var_317_cast_fp16, var_319_cast_fp16, var_321_cast_fp16, var_323_cast_fp16, var_325_cast_fp16, var_327_cast_fp16, var_329_cast_fp16, var_331_cast_fp16, var_333_cast_fp16, var_335_cast_fp16, var_337_cast_fp16, var_339_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> var_348_pad_type_0 = const()[name = tensor<string, []>("op_348_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_348_strides_0 = const()[name = tensor<string, []>("op_348_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_348_pad_0 = const()[name = tensor<string, []>("op_348_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_348_dilations_0 = const()[name = tensor<string, []>("op_348_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_348_groups_0 = const()[name = tensor<string, []>("op_348_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24500032)))];
            tensor<fp16, [1280]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27776896)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_348_cast_fp16 = conv(bias = blocks_0_attn_out_bias_to_fp16, dilations = var_348_dilations_0, groups = var_348_groups_0, pad = var_348_pad_0, pad_type = var_348_pad_type_0, strides = var_348_strides_0, weight = blocks_0_attn_out_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("op_348_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = var_348_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1280]> input_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_7_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27779520)))];
            tensor<fp16, [1280]> input_7_beta_0_to_fp16 = const()[name = tensor<string, []>("input_7_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27782144)))];
            tensor<fp16, []> var_358_to_fp16 = const()[name = tensor<string, []>("op_358_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = input_7_beta_0_to_fp16, epsilon = var_358_to_fp16, gamma = input_7_gamma_0_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [5120, 1280, 1, 1]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [5120, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27784768)))];
            tensor<fp16, [5120]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40892032)))];
            tensor<fp16, [1, 5120, 1, 1500]> input_9_cast_fp16 = conv(bias = blocks_0_mlp_0_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = blocks_0_mlp_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 5120, 1, 1500]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> var_384_pad_type_0 = const()[name = tensor<string, []>("op_384_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_384_strides_0 = const()[name = tensor<string, []>("op_384_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_384_pad_0 = const()[name = tensor<string, []>("op_384_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_384_dilations_0 = const()[name = tensor<string, []>("op_384_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_384_groups_0 = const()[name = tensor<string, []>("op_384_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 5120, 1, 1]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [1280, 5120, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40902336)))];
            tensor<fp16, [1280]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54009600)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_384_cast_fp16 = conv(bias = blocks_0_mlp_2_bias_to_fp16, dilations = var_384_dilations_0, groups = var_384_groups_0, pad = var_384_pad_0, pad_type = var_384_pad_type_0, strides = var_384_strides_0, weight = blocks_0_mlp_2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("op_384_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = var_384_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1280]> input_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_13_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54012224)))];
            tensor<fp16, [1280]> input_13_beta_0_to_fp16 = const()[name = tensor<string, []>("input_13_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54014848)))];
            tensor<fp16, []> var_409_to_fp16 = const()[name = tensor<string, []>("op_409_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = input_13_beta_0_to_fp16, epsilon = var_409_to_fp16, gamma = input_13_gamma_0_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_3_strides_0 = const()[name = tensor<string, []>("q_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_3_dilations_0 = const()[name = tensor<string, []>("q_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_3_groups_0 = const()[name = tensor<string, []>("q_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> var_444_weight_0_to_fp16 = const()[name = tensor<string, []>("op_444_weight_0_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54017472)))];
            tensor<fp16, [1280]> var_444_bias_0_to_fp16 = const()[name = tensor<string, []>("op_444_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57294336)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_444_cast_fp16 = conv(bias = var_444_bias_0_to_fp16, dilations = q_3_dilations_0, groups = q_3_groups_0, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = q_3_strides_0, weight = var_444_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_444_cast_fp16")];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_3_strides_0 = const()[name = tensor<string, []>("k_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_3_dilations_0 = const()[name = tensor<string, []>("k_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_3_groups_0 = const()[name = tensor<string, []>("k_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57296960)))];
            tensor<fp16, [1, 1280, 1, 1500]> k_3_cast_fp16 = conv(dilations = k_3_dilations_0, groups = k_3_groups_0, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = k_3_strides_0, weight = blocks_1_attn_key_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<string, []> var_442_pad_type_0 = const()[name = tensor<string, []>("op_442_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_442_strides_0 = const()[name = tensor<string, []>("op_442_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_442_pad_0 = const()[name = tensor<string, []>("op_442_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_442_dilations_0 = const()[name = tensor<string, []>("op_442_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_442_groups_0 = const()[name = tensor<string, []>("op_442_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60573824)))];
            tensor<fp16, [1280]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63850688)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_442_cast_fp16 = conv(bias = blocks_1_attn_value_bias_to_fp16, dilations = var_442_dilations_0, groups = var_442_groups_0, pad = var_442_pad_0, pad_type = var_442_pad_type_0, strides = var_442_strides_0, weight = blocks_1_attn_value_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_442_cast_fp16")];
            tensor<int32, [20]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [20]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_445_axis_0 = const()[name = tensor<string, []>("op_445_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_11, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_12, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_13, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_14, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_15, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_16, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_17, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_18, tensor<fp16, [1, 64, 1, 1500]> var_445_cast_fp16_19 = split(axis = var_445_axis_0, split_sizes = tile_3, x = var_444_cast_fp16)[name = tensor<string, []>("op_445_cast_fp16")];
            tensor<int32, [4]> var_466_perm_0 = const()[name = tensor<string, []>("op_466_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [20]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [20]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_467_axis_0 = const()[name = tensor<string, []>("op_467_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 1280]> var_466_cast_fp16 = transpose(perm = var_466_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_31")];
            tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_7, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_8, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_9, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_10, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_11, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_12, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_13, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_14, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_15, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_16, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_17, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_18, tensor<fp16, [1, 1500, 1, 64]> var_467_cast_fp16_19 = split(axis = var_467_axis_0, split_sizes = tile_4, x = var_466_cast_fp16)[name = tensor<string, []>("op_467_cast_fp16")];
            tensor<int32, [20]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [20]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_488_axis_0 = const()[name = tensor<string, []>("op_488_axis_0"), val = tensor<int32, []>(1)];
